In [3]:
import pandas as pd
import numpy as np

In [55]:
df = pd.read_csv('StudentsPerformance.csv')
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## groupby which is used to group by non aggregated columns 
## based on group by we can perform aggregation functions ex: min,max,mean,sum

In [19]:
groups_values = df.groupby('gender')

In [20]:
groups_values

In [21]:
res = groups_values.groups # groups is a varaiable which returns dictionary and it keeps values as unique values

In [22]:
res.keys()

dict_keys(['female', 'male'])

In [23]:
res['female']

Index([  0,   1,   2,   5,   6,   9,  12,  14,  15,  17,
       ...
       986, 988, 989, 991, 992, 993, 995, 997, 998, 999],
      dtype='int64', length=518)

In [24]:
res['male']

Index([  3,   4,   7,   8,  10,  11,  13,  16,  18,  20,
       ...
       976, 977, 978, 981, 982, 985, 987, 990, 994, 996],
      dtype='int64', length=482)

## dataframe.get_group()

## get_groups is used to extract particular grouped records
### it is case sensitive

In [25]:
groups_values.get_group('female')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## male ------|group A |
##            |group B | --- count
##            |group C |

## female ------|group A |
##              |group B | --- count
##              |group C |

In [ ]:
grouped_column = df.groupby('gender')

In [48]:
male = grouped_column.get_group('male')
female = grouped_column.get_group('female')

In [51]:
male['race/ethnicity'].value_counts(ascending=True)

race/ethnicity
group A     53
group E     71
group B     86
group D    133
group C    139
Name: count, dtype: int64

In [52]:
female['race/ethnicity'].value_counts(ascending=True)

race/ethnicity
group A     36
group E     69
group B    104
group D    129
group C    180
Name: count, dtype: int64

In [54]:
df.groupby('gender')['race/ethnicity'].value_counts(ascending=True)

gender  race/ethnicity
female  group A            36
        group E            69
        group B           104
        group D           129
        group C           180
male    group A            53
        group E            71
        group B            86
        group D           133
        group C           139
Name: count, dtype: int64

In [55]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [70]:
g_c = df.groupby('gender')['writing score'].mean()
g_c

gender
female    72.467181
male      63.311203
Name: writing score, dtype: float64

## get the group A along with associate degree of male

In [81]:
df['gender'] = 'male'
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,72,72,74
1,male,group C,some college,standard,completed,69,90,88
2,male,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,male,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,male,group C,high school,free/reduced,completed,59,71,65
998,male,group D,some college,standard,completed,68,78,77
999,male,group D,some college,free/reduced,none,77,86,86

In [ ]:
df.query('(gender == "male") & (`race/ethnicity` == "group A") & (`parental level of education` == "associate\'s degree")')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
62,male,group A,associate's degree,free/reduced,none,62,61,55
112,male,group A,associate's degree,standard,none,54,53,47
356,male,group A,associate's degree,standard,none,63,61,61
489,male,group A,associate's degree,free/reduced,completed,79,82,82
539,male,group A,associate's degree,standard,completed,97,92,86
575,male,group A,associate's degree,free/reduced,completed,40,55,53
936,male,group A,associate's degree,standard,none,67,57,53

In [99]:
df[(df['gender'] == 'male') & (df['race/ethnicity'] == "group A") & (df['parental level of education'] == "associate's degree")]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
62,male,group A,associate's degree,free/reduced,none,62,61,55
112,male,group A,associate's degree,standard,none,54,53,47
356,male,group A,associate's degree,standard,none,63,61,61
489,male,group A,associate's degree,free/reduced,completed,79,82,82
539,male,group A,associate's degree,standard,completed,97,92,86
575,male,group A,associate's degree,free/reduced,completed,40,55,53
936,male,group A,associate's degree,standard,none,67,57,53

In [ ]:
gv = groups.groupby(['gender','race/ethnicity','parental level of education'])
gv.get_group(('male','group A','associate\'s degree'))

## reset_index()

In [14]:
filter = df.groupby('gender').get_group('male')
filter.reset_index(inplace=True)

In [15]:
filter

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,3,male,group A,associate's degree,free/reduced,none,47,57,44
1,4,male,group C,some college,standard,none,76,78,75
2,7,male,group B,some college,free/reduced,none,40,43,39
3,8,male,group D,high school,free/reduced,completed,64,64,67
4,10,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...,...
477,985,male,group A,high school,standard,none,57,51,54
478,987,male,group E,some high school,standard,completed,81,75,76
479,990,male,group E,high school,free/reduced,completed,86,81,75
480,994,male,group A,high school,standard,none,63,63,62
481,996,male,group C,high school,free/reduced,none,62,55,55

In [18]:
filter.drop(['index'],axis=1) # here inplace=True doesn't return table

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group A,associate's degree,free/reduced,none,47,57,44
1,male,group C,some college,standard,none,76,78,75
2,male,group B,some college,free/reduced,none,40,43,39
3,male,group D,high school,free/reduced,completed,64,64,67
4,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...
477,male,group A,high school,standard,none,57,51,54
478,male,group E,some high school,standard,completed,81,75,76
479,male,group E,high school,free/reduced,completed,86,81,75
480,male,group A,high school,standard,none,63,63,62
481,male,group C,high school,free/reduced,none,62,55,55

In [5]:
filter = df.groupby('gender').get_group('male')
filter.reset_index(inplace=True,drop=True) # drop = True removes the index if it is false it keeps

In [6]:
filter.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group A,associate's degree,free/reduced,none,47,57,44
1,male,group C,some college,standard,none,76,78,75
2,male,group B,some college,free/reduced,none,40,43,39
3,male,group D,high school,free/reduced,completed,64,64,67
4,male,group C,associate's degree,standard,none,58,54,52
5,male,group D,associate's degree,standard,none,40,52,43
6,male,group A,some college,standard,completed,78,72,70
7,male,group C,high school,standard,none,88,89,86
8,male,group C,master's degree,free/reduced,completed,46,42,46
9,male,group D,high school,standard,none,66,69,63

In [16]:
df1 = pd.DataFrame({'SRH':['Abhishek Sharma','Travis Head','Pat Cummins','Henrich Klassen','Ishan Kishan'],
                   'CSK':['MS Dhoni','Albie Morkel','Suresh Raina','Ravindra Jadeja','DJ Bravo']})
df1

               SRH              CSK
0  Abhishek Sharma         MS Dhoni
1      Travis Head     Albie Morkel
2      Pat Cummins     Suresh Raina
3  Henrich Klassen  Ravindra Jadeja
4     Ishan Kishan         DJ Bravo

In [19]:
df2 = pd.DataFrame({'SRH':['David Warner','Kane Williamson','Bhuvenshwar Kumar','Rashid Khan','Shikwar Dhawan'],
                   'HDC':['Adam Gilchrist','Andrew Simons','Rohit Sharma','RP Singh','H Gibbs']})
df2

                 SRH             HDC
0       David Warner  Adam Gilchrist
1    Kane Williamson   Andrew Simons
2  Bhuvenshwar Kumar    Rohit Sharma
3        Rashid Khan        RP Singh
4     Shikwar Dhawan         H Gibbs

In [42]:
df3 = pd.DataFrame({'SRH':['David Warner','Kane Williamson','Bhuvenshwar Kumar','Rashid Khan','Shikwar Dhawan'],
                   'MI':['Rohit Sharma','Lasit Malinga','Kieren Pollard','Hardik Pandya','Jasprit Bumra']})
df3

                 SRH              MI
0       David Warner    Rohit Sharma
1    Kane Williamson   Lasit Malinga
2  Bhuvenshwar Kumar  Kieren Pollard
3        Rashid Khan   Hardik Pandya
4     Shikwar Dhawan   Jasprit Bumra

In [29]:
pd.concat([df1,df2]) # by default axis = 0 so it adds row wise means downwards

                 SRH              CSK             HDC
0    Abhishek Sharma         MS Dhoni             NaN
1        Travis Head     Albie Morkel             NaN
2        Pat Cummins     Suresh Raina             NaN
3    Henrich Klassen  Ravindra Jadeja             NaN
4       Ishan Kishan         DJ Bravo             NaN
0       David Warner              NaN  Adam Gilchrist
1    Kane Williamson              NaN   Andrew Simons
2  Bhuvenshwar Kumar              NaN    Rohit Sharma
3        Rashid Khan              NaN        RP Singh
4     Shikwar Dhawan              NaN         H Gibbs

In [51]:
pd.concat([df1,df3],join='inner',axis=0,ignore_index=True) # works with only axis = 0

                 SRH
0    Abhishek Sharma
1        Travis Head
2        Pat Cummins
3    Henrich Klassen
4       Ishan Kishan
5       David Warner
6    Kane Williamson
7  Bhuvenshwar Kumar
8        Rashid Khan
9     Shikwar Dhawan

In [53]:
pd.concat([df1,df3],join='inner',axis=1)

               SRH              CSK                SRH              MI
0  Abhishek Sharma         MS Dhoni       David Warner    Rohit Sharma
1      Travis Head     Albie Morkel    Kane Williamson   Lasit Malinga
2      Pat Cummins     Suresh Raina  Bhuvenshwar Kumar  Kieren Pollard
3  Henrich Klassen  Ravindra Jadeja        Rashid Khan   Hardik Pandya
4     Ishan Kishan         DJ Bravo     Shikwar Dhawan   Jasprit Bumra

In [60]:
male = df.groupby('gender').get_group('male')
female = df.groupby('gender').get_group('female')

In [68]:
new_df = pd.concat([male,female],keys = ['male','female'])
# new_df.index
new_df

            gender race/ethnicity parental level of education         lunch  \
male   3      male        group A          associate's degree  free/reduced
       4      male        group C                some college      standard
       7      male        group B                some college  free/reduced
       8      male        group D                 high school  free/reduced
       10     male        group C          associate's degree      standard
...            ...            ...                         ...           ...
female 993  female        group D           bachelor's degree  free/reduced
       995  female        group E             master's degree      standard
       997  female        group C                 high school  free/reduced
       998  female        group D                some college      standard
       999  female        group D                some college  free/reduced

           test preparation course  math score  reading score  writing score
male   3                      none          47             57             44
       4                      none          76             78             75
       7                      none          40             43             39
       8                 completed          64             64             67
       10                     none          58             54             52
...                            ...         ...            ...            ...
female 993                    none          62             72             74
       995               completed          88             99             95
       997               completed          59             71             65
       998               completed          68             78             77
       999                    none          77             86             86

[1000 rows x 8 columns]